Repository: wolfwdavid/cross_platform_c11
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, uk, zh_hans, zh_hant

# command.unpinTab.title
source: Unpin Tab
ja: タブのピンを外す
ko: 탭 고정 해제
ru: Открепить вкладку
uk: Відкріпити вкладку
zh_hans: 取消固定标签页
zh_hant: 取消釘選標籤頁

# command.unpinWorkspace.title
source: Unpin Workspace
ja: ワークスペースのピンを外す
ko: 작업 공간 고정 해제
ru: Открепить рабочее пространство
uk: Відкріпити робочий простір
zh_hans: 取消固定工作区
zh_hant: 取消釘選工作區

# command.vscodeServeWebRestart.title
source: Restart VS Code Inline Server
ja: VS Codeインラインサーバーを再起動
ko: VS Code 인라인 서버 재시작
ru: Перезапустить встроенный сервер VS Code
uk: Перезапустити вбудований сервер VS Code
zh_hans: 重启 VS Code 内联服务器
zh_hant: 重新啟動 VS Code 內嵌伺服器

# command.vscodeServeWebStop.title
source: Stop VS Code Inline Server
ja: VS Codeインラインサーバーを停止
ko: VS Code 인라인 서버 중지
ru: Остановить встроенный сервер VS Code
uk: Зупинити вбудований сервер VS Code
zh_hans: 停止 VS Code 内联服务器
zh_hant: 停止 VS Code 內嵌伺服器

# commandPalette.kind.browser
source: Browser
ja: ブラウザ
ko: 브라우저
ru: Браузер
uk: Браузер
zh_hans: 浏览器
zh_hant: 瀏覽器

# commandPalette.kind.terminal
source: Terminal
ja: ターミナル
ko: 터미널
ru: Терминал
uk: Термінал
zh_hans: 终端
zh_hant: 終端機

# commandPalette.kind.workspace
source: Workspace
ja: ワークスペース
ko: 작업 공간
ru: Рабочее пространство
uk: Робочий простір
zh_hans: 工作区
zh_hant: 工作區

# commandPalette.rename.clearCustomName
source: (clear custom name)
ja: （カスタム名をクリア）
ko: (사용자 지정 이름 지우기)
ru: (очистить пользовательское имя)
uk: (очистити власне ім'я)
zh_hans: （清除自定义名称）
zh_hant: （清除自訂名稱）

# commandPalette.rename.tabConfirmHint
source: Press Enter to rename the tab. Press Escape to cancel.
ja: Enter でタブ名を変更します。Escape でキャンセルします。
ko: Enter를 눌러 탭 이름을 변경하세요. Escape를 눌러 취소하세요.
ru: Нажмите Enter, чтобы переименовать вкладку. Нажмите Escape для отмены.
uk: Натисніть Enter, щоб перейменувати вкладку. Натисніть Escape, щоб скасувати.
zh_hans: 按 Enter 重命名标签页。按 Escape 取消。
zh_hant: 按 Enter 重新命名標籤頁。按 Escape 取消。

# commandPalette.rename.tabDescription
source: Pick a custom tab name.
ja: タブのカスタム名を選んでください。
ko: 사용자 지정 탭 이름을 선택하세요.
ru: Задайте своё имя вкладки.
uk: Оберіть назву вкладки.
zh_hans: 为标签页选择自定义名称。
zh_hant: 選擇自訂標籤頁名稱。

# commandPalette.rename.tabInputHint
source: Type a tab name. Press Enter to rename, Escape to cancel.
ja: タブ名を入力してください。Enter で名称変更、Escape でキャンセル。
ko: 탭 이름을 입력하세요. Enter로 이름 변경, Escape로 취소.
ru: Введите имя вкладки. Нажмите Enter для переименования, Escape для отмены.
uk: Введіть назву вкладки. Enter — перейменувати, Escape — скасувати.
zh_hans: 输入标签页名称。按 Enter 重命名，按 Escape 取消。
zh_hant: 輸入標籤頁名稱。按 Enter 重新命名，按 Escape 取消。

# commandPalette.rename.tabPlaceholder
source: Tab name
ja: タブ名
ko: 탭 이름
ru: Имя вкладки
uk: Ім'я вкладки
zh_hans: 标签页名称
zh_hant: 標籤頁名稱

# commandPalette.rename.tabTitle
source: Rename Tab
ja: タブの名称変更
ko: 탭 이름 변경
ru: Переименовать вкладку
uk: Перейменувати вкладку
zh_hans: 重命名标签页
zh_hant: 重新命名標籤頁

# commandPalette.rename.workspaceConfirmHint
source: Press Enter to rename the workspace. Press Escape to cancel.
ja: Enter でワークスペース名を変更します。Escape でキャンセルします。
ko: Enter를 눌러 작업 공간 이름을 변경하세요. Escape를 눌러 취소하세요.
ru: Нажмите Enter, чтобы переименовать рабочее пространство. Нажмите Escape для отмены.
uk: Натисніть Enter, щоб перейменувати робочий простір. Натисніть Escape, щоб скасувати.
zh_hans: 按 Enter 重命名工作区。按 Escape 取消。
zh_hant: 按 Enter 重新命名工作區。按 Escape 取消。

# commandPalette.rename.workspaceDescription
source: Pick a custom workspace name.
ja: ワークスペースのカスタム名を選んでください。
ko: 사용자 지정 작업 공간 이름을 선택하세요.
ru: Задайте своё имя рабочего пространства.
uk: Оберіть назву робочого простору.
zh_hans: 为工作区选择自定义名称。
zh_hant: 選擇自訂工作區名稱。

# commandPalette.rename.workspaceInputHint
source: Type a workspace name. Press Enter to rename, Escape to cancel.
ja: ワークスペース名を入力してください。Enter で名称変更、Escape でキャンセル。
ko: 작업 공간 이름을 입력하세요. Enter로 이름 변경, Escape로 취소.
ru: Введите имя рабочего пространства. Нажмите Enter для переименования, Escape для отмены.
uk: Введіть назву робочого простору. Enter — перейменувати, Escape — скасувати.
zh_hans: 输入工作区名称。按 Enter 重命名，按 Escape 取消。
zh_hant: 輸入工作區名稱。按 Enter 重新命名，按 Escape 取消。

# commandPalette.rename.workspacePlaceholder
source: Workspace name
ja: ワークスペース名
ko: 작업 공간 이름
ru: Имя рабочего пространства
uk: Ім'я робочого простору
zh_hans: 工作区名称
zh_hant: 工作區名稱

# commandPalette.rename.workspaceTitle
source: Rename Workspace
ja: ワークスペースの名称変更
ko: 작업 공간 이름 변경
ru: Переименовать рабочее пространство
uk: Перейменувати робочий простір
zh_hans: 重命名工作区
zh_hant: 重新命名工作區

# commandPalette.search.commandsEmpty
source: No commands match.
ja: 該当するコマンドはありません。
ko: 일치하는 명령어가 없습니다.
ru: Нет подходящих команд.
uk: Немає відповідних команд.
zh_hans: 没有匹配的命令。
zh_hant: 沒有符合的指令。

# commandPalette.search.commandsPlaceholder
source: Type a command
ja: コマンドを入力
ko: 명령어를 입력하세요
ru: Введите команду
uk: Введіть команду
zh_hans: 输入命令
zh_hant: 輸入指令

# commandPalette.search.switcherEmpty
source: No workspaces match.
ja: 該当するワークスペースはありません。
ko: 일치하는 작업 공간이 없습니다.
ru: Нет подходящих рабочих пространств.
uk: Немає відповідних робочих просторів.
zh_hans: 没有匹配的工作区。
zh_hant: 沒有符合的工作區。

# commandPalette.search.switcherEmptyAllSurfaces
source: No workspaces or surfaces match.
ja: 該当するワークスペースまたはサーフェスはありません。
ko: 일치하는 작업 공간 또는 서피스가 없습니다.
ru: Нет подходящих рабочих пространств или поверхностей.
uk: Немає відповідних робочих просторів чи поверхонь.
zh_hans: 没有匹配的工作区或表面。
zh_hant: 沒有符合的工作區或介面。

# commandPalette.search.switcherPlaceholder
source: Search workspaces
ja: ワークスペースを検索
ko: 작업 공간 검색
ru: Поиск рабочих пространств
uk: Пошук робочих просторів
zh_hans: 搜索工作区
zh_hant: 搜尋工作區

# commandPalette.search.switcherPlaceholderAllSurfaces
source: Search workspaces and surfaces
ja: ワークスペースとサーフェスを検索
ko: 작업 공간과 서피스 검색
ru: Поиск рабочих пространств и поверхностей
uk: Пошук робочих просторів і поверхонь
zh_hans: 搜索工作区和界面
zh_hant: 搜尋工作區與介面

# commandPalette.subtitle.browserWithName
source: Browser • %@
ja: ブラウザ • %@
ko: 브라우저 • %@
ru: Браузер • %@
uk: Браузер • %@
zh_hans: 浏览器 • %@
zh_hant: 瀏覽器 • %@

# commandPalette.subtitle.tabFallback
source: Tab
ja: タブ
ko: 탭
ru: Вкладка
uk: Вкладка
zh_hans: 标签页
zh_hant: 標籤頁

# commandPalette.subtitle.tabWithName
source: Tab • %@
ja: タブ • %@
ko: 탭 • %@
ru: Вкладка • %@
uk: Вкладка • %@
zh_hans: 标签页 • %@
zh_hant: 標籤頁 • %@

# commandPalette.subtitle.terminalWithName
source: Terminal • %@
ja: ターミナル • %@
ko: 터미널 • %@
ru: Терминал • %@
uk: Термінал • %@
zh_hans: 终端 • %@
zh_hant: 終端機 • %@

# commandPalette.subtitle.workspaceFallback
source: Workspace
ja: ワークスペース
ko: 작업 공간
ru: Рабочее пространство
uk: Робочий простір
zh_hans: 工作区
zh_hant: 工作區

# commandPalette.subtitle.workspaceWithName
source: Workspace • %@
ja: ワークスペース • %@
ko: 작업 공간 • %@
ru: Рабочее пространство • %@
uk: Робочий простір • %@
zh_hans: 工作区 • %@
zh_hant: 工作區 • %@

# commandPalette.switcher.windowLabel
source: Window %lld
ja: ウインドウ %lld
ko: 윈도우 %lld
ru: Окно %lld
uk: Вікно %lld
zh_hans: 窗口 %lld
zh_hant: 視窗 %lld

# commandPalette.switcher.workspaceLabel
source: Workspace
ja: ワークスペース
ko: 작업 공간
ru: Рабочее пространство
uk: Робочий простір
zh_hans: 工作区
zh_hant: 工作區

# common.allow
source: Allow
ja: 許可
ko: 허용
ru: Разрешить
uk: Дозволити
zh_hans: 允许
zh_hant: 允許

# common.cancel
source: Cancel
ja: キャンセル
ko: 취소
ru: Отменить
uk: Скасувати
zh_hans: 取消
zh_hant: 取消

# common.close
source: Close
ja: 閉じる
ko: 닫기
ru: Закрыть
uk: Закрити
zh_hans: 关闭
zh_hant: 關閉

# common.copyDetails
source: Copy Details
ja: 詳細をコピー
ko: 세부 정보 복사
ru: Скопировать подробности
uk: Скопіювати подробиці
zh_hans: 拷贝详细信息
zh_hant: 拷貝詳細資訊

# common.create
source: Create
ja: 作成
ko: 만들기
ru: Создать
uk: Створити
zh_hans: 创建
zh_hant: 建立

# common.dontSave
source: Don't Save
ja: 保存しない
ko: 저장 안 함
ru: Не сохранять
uk: Не зберігати
zh_hans: 不存储
zh_hant: 不儲存

# common.installAndRelaunch
source: Install and Relaunch
ja: インストールして再起動
ko: 설치 후 재실행
ru: Установить и перезапустить
uk: Встановити та перезапустити
zh_hans: 安装并重新启动
zh_hant: 安裝並重新啟動

# common.later
source: Later
ja: 後で
ko: 나중에
ru: Позже
uk: Пізніше
zh_hans: 稍后
zh_hant: 稍後

# common.notNow
source: Not Now
ja: 今はしない
ko: 나중에
ru: Не сейчас
uk: Не зараз
zh_hans: 以后再说
zh_hant: 現在不要

# common.rename
source: Rename
ja: 名前を変更
ko: 이름 변경
ru: Переименовать
uk: Перейменувати
zh_hans: 重命名
zh_hant: 重新命名

# common.restartLater
source: Restart Later
ja: 後で再起動
ko: 나중에 재시작
ru: Перезапустить позже
uk: Перезапустити пізніше
zh_hans: 稍后重启
zh_hant: 稍後重新啟動

# common.restartNow
source: Restart Now
ja: 今すぐ再起動
ko: 지금 재시작
ru: Перезапустить сейчас
uk: Перезапустити зараз
zh_hans: 立即重启
zh_hant: 立即重新啟動

# common.retry
source: Retry
ja: 再試行
ko: 재시도
ru: Повторить
uk: Повторити
zh_hans: 重试
zh_hant: 重試

# common.skip
source: Skip
ja: スキップ
ko: 건너뛰기
ru: Пропустить
uk: Пропустити
zh_hans: 跳过
zh_hant: 略過

# contextMenu.chooseCustomColor
source: Choose Custom Color…
ja: カスタムカラーを選択…
ko: 사용자 지정 색상 선택…
ru: Выбрать пользовательский цвет...
uk: Обрати власний колір…
zh_hans: 选取自定义颜色...
zh_hant: 選擇自訂顏色...

# contextMenu.clearColor
source: Clear Color
ja: カラーをクリア
ko: 색상 지우기
ru: Убрать цвет
uk: Очистити колір
zh_hans: 清除颜色
zh_hant: 清除顏色

# contextMenu.closeOtherWorkspaces
source: Close Other Workspaces
ja: 他のワークスペースを閉じる
ko: 다른 작업 공간 닫기
ru: Закрыть другие рабочие пространства
uk: Закрити інші робочі простори
zh_hans: 关闭其他工作区
zh_hant: 關閉其他工作區

# contextMenu.closeWorkspace
source: Close Workspace
ja: ワークスペースを閉じる
ko: 작업 공간 닫기
ru: Закрыть рабочее пространство
uk: Закрити робочий простір
zh_hans: 关闭工作区
zh_hant: 關閉工作區

# contextMenu.closeWorkspaces
source: Close Workspaces
ja: ワークスペースを閉じる
ko: 작업 공간 닫기
ru: Закрыть рабочие пространства
uk: Закрити робочі простори
zh_hans: 关闭工作区
zh_hant: 關閉工作區

# contextMenu.closeWorkspacesAbove
source: Close Workspaces Above
ja: 上のワークスペースを閉じる
ko: 위쪽 작업 공간 닫기
ru: Закрыть рабочие пространства выше
uk: Закрити робочі простори вище
zh_hans: 关闭上方工作区
zh_hant: 關閉上方的工作區

# contextMenu.closeWorkspacesBelow
source: Close Workspaces Below
ja: 下のワークスペースを閉じる
ko: 아래쪽 작업 공간 닫기
ru: Закрыть рабочие пространства ниже
uk: Закрити робочі простори нижче
zh_hans: 关闭下方工作区
zh_hant: 關閉下方的工作區

# contextMenu.copyError
source: Copy Error
ja: エラーをコピー
ko: 오류 복사
ru: Скопировать ошибку
uk: Скопіювати помилку
zh_hans: 复制错误
zh_hant: 複製錯誤

# contextMenu.copyErrors
source: Copy Errors
ja: エラーをコピー
ko: 오류 복사
ru: Скопировать ошибки
uk: Скопіювати помилки
zh_hans: 复制错误
zh_hant: 複製錯誤

# contextMenu.copySshError
source: Copy SSH Error
ja: SSHエラーをコピー
ko: SSH 오류 복사
ru: Скопировать ошибку SSH
uk: Скопіювати помилку SSH
zh_hans: 复制 SSH 错误
zh_hant: 複製 SSH 錯誤

# contextMenu.disconnectWorkspace
source: Disconnect Workspace
ja: ワークスペースを切断
ko: 작업 공간 연결 해제
ru: Отключить рабочее пространство
uk: Від'єднати робочий простір
zh_hans: 断开工作区
zh_hant: 中斷工作區連線

# contextMenu.disconnectWorkspaces
source: Disconnect Workspaces
ja: ワークスペースを切断
ko: 작업 공간 연결 해제
ru: Отключить рабочие пространства
uk: Від'єднати робочі простори
zh_hans: 断开工作区
zh_hant: 中斷工作區連線

# contextMenu.hibernateWorkspace
source: Hibernate Workspace
ja: ワークスペースを休止
ko: 작업 공간 절전
ru: Усыпить рабочее пространство
uk: Призупинити робочий простір
zh_hans: 休眠工作区
zh_hant: 休眠工作區

# contextMenu.hibernateWorkspaceTooltip
source: Suspends browser surfaces in this workspace. Terminals stay on auto-throttle (already low-CPU when the workspace isn't focused).
ja: このワークスペース内のブラウザサーフェスを一時停止します。ターミナルは自動スロットルのまま動作します（ワークスペースが非フォーカス時はすでに低CPU使用率）。
ko: 이 작업 공간의 브라우저 서피스를 일시 중단합니다. 터미널은 자동 스로틀 상태를 유지합니다(작업 공간에 포커스가 없을 때 이미 CPU 사용량이 낮음).
ru: Приостанавливает поверхности браузера в этом рабочем пространстве. Терминалы остаются на автодросселировании (уже с низким потреблением ЦП, когда рабочее пространство не в фокусе).
uk: Призупиняє браузерні поверхні в цьому робочому просторі. Термінали залишаються на автодроселюванні (вже з низьким завантаженням ЦП, коли робочий простір не у фокусі).
zh_hans: 暂停此工作区中的浏览器界面。终端保持自动节流（工作区未聚焦时 CPU 占用已较低）。
zh_hant: 暫停此工作區中的瀏覽器介面。終端機維持自動節流（工作區未聚焦時 CPU 佔用已較低）。

# contextMenu.markWorkspaceRead
source: Mark Workspace as Read
ja: ワークスペースを既読にする
ko: 작업 공간을 읽음으로 표시
ru: Отметить рабочее пространство как прочитанное
uk: Позначити робочий простір як прочитаний
zh_hans: 将工作区标记为已读
zh_hant: 將工作區標為已讀

# contextMenu.markWorkspaceUnread
source: Mark Workspace as Unread
ja: ワークスペースを未読にする
ko: 작업 공간을 읽지 않음으로 표시
ru: Отметить рабочее пространство как непрочитанное
uk: Позначити робочий простір як непрочитаний
zh_hans: 将工作区标记为未读
zh_hant: 將工作區標為未讀

# contextMenu.markWorkspacesRead
source: Mark Workspaces as Read
ja: ワークスペースを既読にする
ko: 작업 공간을 읽음으로 표시
ru: Отметить рабочие пространства как прочитанные
uk: Позначити робочі простори як прочитані
zh_hans: 将工作区标记为已读
zh_hant: 將工作區標為已讀

# contextMenu.markWorkspacesUnread
source: Mark Workspaces as Unread
ja: ワークスペースを未読にする
ko: 작업 공간을 읽지 않음으로 표시
ru: Отметить рабочие пространства как непрочитанные
uk: Позначити робочі простори як непрочитані
zh_hans: 将工作区标记为未读
zh_hant: 將工作區標為未讀

# contextMenu.moveDown
source: Move Down
ja: 下に移動
ko: 아래로 이동
ru: Переместить вниз
uk: Перемістити вниз
zh_hans: 下移
zh_hant: 下移

# contextMenu.moveToTop
source: Move to Top
ja: 一番上に移動
ko: 맨 위로 이동
ru: Переместить наверх
uk: Перемістити нагору
zh_hans: 移到顶部
zh_hant: 移至最上方

# contextMenu.moveUp
source: Move Up
ja: 上に移動
ko: 위로 이동
ru: Переместить вверх
uk: Перемістити вгору
zh_hans: 上移
zh_hant: 上移

# contextMenu.moveWorkspaceToWindow
source: Move Workspace to Window
ja: ワークスペースをウインドウに移動
ko: 작업 공간을 윈도우로 이동
ru: Переместить рабочее пространство в окно
uk: Перемістити робочий простір у вікно
zh_hans: 将工作区移到窗口
zh_hant: 將工作區移至視窗

# contextMenu.moveWorkspacesToWindow
source: Move Workspaces to Window
ja: ワークスペースをウインドウに移動
ko: 작업 공간을 윈도우로 이동
ru: Переместить рабочие пространства в окно
uk: Перемістити робочі простори у вікно
zh_hans: 将工作区移到窗口
zh_hant: 將工作區移至視窗

# contextMenu.newWindow
source: New Window
ja: 新規ウインドウ
ko: 새 윈도우
ru: Новое окно
uk: Нове вікно
zh_hans: 新建窗口
zh_hant: 新增視窗

# contextMenu.pinWorkspace
source: Pin Workspace
ja: ワークスペースをピンで固定
ko: 작업 공간 고정
ru: Закрепить рабочее пространство
uk: Закріпити робочий простір
zh_hans: 固定工作区
zh_hant: 釘選工作區

# contextMenu.pinWorkspaces
source: Pin Workspaces
ja: ワークスペースをピンで固定
ko: 작업 공간 고정
ru: Закрепить рабочие пространства
uk: Закріпити робочі простори
zh_hans: 固定工作区
zh_hant: 釘選工作區

# contextMenu.reconnectWorkspace
source: Reconnect Workspace
ja: ワークスペースを再接続
ko: 작업 공간 다시 연결
ru: Переподключить рабочее пространство
uk: Знову під'єднати робочий простір
zh_hans: 重新连接工作区
zh_hant: 重新連線工作區

# contextMenu.reconnectWorkspaces
source: Reconnect Workspaces
ja: ワークスペースを再接続
ko: 작업 공간 다시 연결
ru: Переподключить рабочие пространства
uk: Знову під'єднати робочі простори
zh_hans: 重新连接工作区
zh_hant: 重新連線工作區

# contextMenu.removeCustomWorkspaceName
source: Reset Workspace Name
ja: ワークスペース名をリセット
ko: 작업 공간 이름 재설정
ru: Сбросить имя рабочего пространства
uk: Скинути назву робочого простору
zh_hans: 重置工作区名称
zh_hant: 重設工作區名稱

# contextMenu.renameWorkspace
source: Rename Workspace…
ja: ワークスペースの名称変更…
ko: 작업 공간 이름 변경…
ru: Переименовать рабочее пространство...
uk: Перейменувати робочий простір…
zh_hans: 重命名工作区...
zh_hant: 重新命名工作區...

# contextMenu.resumeWorkspace
source: Resume Workspace
ja: ワークスペースを再開
ko: 작업 공간 다시 시작
ru: Возобновить рабочее пространство
uk: Відновити робочий простір
zh_hans: 恢复工作区
zh_hant: 恢復工作區

# contextMenu.unpinWorkspace
source: Unpin Workspace
ja: ワークスペースのピンを外す
ko: 작업 공간 고정 해제
ru: Открепить рабочее пространство
uk: Відкріпити робочий простір
zh_hans: 取消固定工作区
zh_hant: 取消釘選工作區

# contextMenu.unpinWorkspaces
source: Unpin Workspaces
ja: ワークスペースのピンを外す
ko: 작업 공간 고정 해제
ru: Открепить рабочие пространства
uk: Відкріпити робочі простори
zh_hans: 取消固定工作区
zh_hant: 取消釘選工作區

# contextMenu.workspaceColor
source: Workspace Color
ja: ワークスペースカラー
ko: 작업 공간 색상
ru: Цвет рабочего пространства
uk: Колір робочого простору
zh_hans: 工作区颜色
zh_hant: 工作區顏色

# contextMenu.workspaceColor.tooltip
source: Per-workspace accent. c11 theme (Light/Dark) lives in Settings → Theme.
ja: ワークスペースごとのアクセント。c11 テーマ（ライト／ダーク）は「設定」→「テーマ」にあります。
ko: 작업 공간별 강조색. c11 테마(라이트/다크)는 설정 → 테마에 있습니다.
ru: Акцент для рабочего пространства. Тема c11 (светлая/тёмная) — в Настройки → Тема.
uk: Акцент для кожного робочого простору. Тема c11 (світла/темна) — Налаштування → Тема.
zh_hans: 每个工作区的强调色。c11 主题（浅色/深色）位于设置 → 主题。
zh_hant: 各工作區強調色。c11 主題（淺色／深色）位於「設定 → 主題」。

# createWorkspace.baseDirectory.label
source: Base directory for your new workspace
ja: 新しいワークスペースのベースディレクトリ
ko: 새 워크스페이스의 기본 디렉터리
ru: Базовая директория для нового рабочего пространства
uk: Базова директорія для нового робочого простору
zh_hans: 新工作区的基础目录
zh_hant: 新工作區的基礎目錄

# createWorkspace.customBlueprints.count
source: %d blueprints
ja: %d 個のブループリント
ko: %d개의 블루프린트
ru: blueprint: %d
uk: %d blueprint
zh_hans: %d 个蓝图
zh_hant: %d 個藍圖

# createWorkspace.customBlueprints.empty
source: No custom blueprints yet.
ja: カスタムブループリントはまだありません。
ko: 사용자 정의 블루프린트가 아직 없습니다.
ru: Пользовательских blueprint пока нет.
uk: Користувацьких blueprint поки що немає.
zh_hans: 暂无自定义蓝图。
zh_hant: 暫無自訂藍圖。

# createWorkspace.customBlueprints.help.body1
source: Saved pane and surface layouts you can launch a workspace from.
ja: ワークスペースの起動に使える、保存されたペインとサーフェスのレイアウトです。
ko: 워크스페이스를 시작할 수 있는 저장된 패널 및 서피스 레이아웃입니다.
ru: Сохранённые компоновки панелей и поверхностей, из которых можно запустить рабочее пространство.
uk: Збережені компонування панелей і поверхонь, з яких можна запустити робочий простір.
zh_hans: 可用于启动工作区的已保存窗格和表面布局。
zh_hant: 可用於啟動工作區的已儲存窗格和表面版面。

# createWorkspace.customBlueprints.help.body2
source: c11 is agent-first software, so we didn't build a UI to make these. Just ask your agent. It can write a blueprint file to your blueprints folder, and it'll show up here.
ja: c11 はエージェントファーストのソフトウェアなので、作成 UI は用意していません。エージェントに頼んでください。エージェントが blueprint ファイルをフォルダに書き込めば、ここに表示されます。
ko: c11은 에이전트 우선 소프트웨어이므로 이를 만들 UI를 만들지 않았습니다. 에이전트에게 요청하세요. 에이전트가 블루프린트 파일을 폴더에 작성하면 여기에 표시됩니다.
ru: c11 — это программное обеспечение, ориентированное на агентов, поэтому мы не создавали UI для этого. Просто попросите своего агента. Он может записать файл blueprint в вашу папку, и он появится здесь.
uk: c11 — це програмне забезпечення, орієнтоване на агентів, тож ми не створювали UI для цього. Просто попросіть свого агента. Він може записати файл blueprint у вашу папку, і він з’явиться тут.
zh_hans: c11 是代理优先的软件，因此我们没有为此构建 UI。让你的代理来做。它可以将蓝图文件写入你的蓝图文件夹，然后就会显示在这里。
zh_hant: c11 是代理優先的軟體，因此我們沒有為此建立 UI。讓你的代理來做。它可以將藍圖檔案寫入你的藍圖資料夾，然後就會顯示在這裡。

# createWorkspace.customBlueprints.help.reveal
source: Reveal blueprints folder
ja: blueprint フォルダを表示
ko: 블루프린트 폴더 표시
ru: Показать папку blueprints
uk: Показати папку blueprints
zh_hans: 显示蓝图文件夹
zh_hant: 顯示藍圖資料夾

# createWorkspace.customBlueprints.helpHint
source: What is a custom blueprint?
ja: カスタムブループリントとは?
ko: 사용자 정의 블루프린트란?
ru: Что такое пользовательский blueprint?
uk: Що таке користувацький blueprint?
zh_hans: 什么是自定义蓝图？
zh_hant: 什麼是自訂藍圖？

# createWorkspace.dropTarget
source: Drop folder to set base directory
ja: フォルダをドロップしてベースディレクトリを設定
ko: 폴더를 드롭하여 기본 디렉터리 설정
ru: Перетащите папку, чтобы задать базовую директорию
uk: Перетягніть папку, щоб встановити базову директорію
zh_hans: 拖放文件夹以设置基础目录
zh_hant: 拖放資料夾以設定基礎目錄

# createWorkspace.launchAgent
source: Launch your default coding agent in the first pane
ja: 最初のペインでデフォルトのコーディングエージェントを起動
ko: 첫 번째 패널에서 기본 코딩 에이전트 실행
ru: Запустить вашего стандартного агента-программиста в первой панели
uk: Запустити вашого стандартного агента програмування на першій панелі
zh_hans: 在第一个窗格中启动你的默认编码代理
zh_hant: 在第一個窗格中啟動你的預設編碼代理

# createWorkspace.layouts
source: Layouts
ja: レイアウト
ko: 레이아웃
ru: Макеты
uk: Розкладки
zh_hans: 布局
zh_hant: 版面

# createWorkspace.legend.agent
source: agent
ja: エージェント
ko: 에이전트
ru: агент
uk: агент
zh_hans: 代理
zh_hant: 代理

# createWorkspace.legend.browser
source: browser
ja: ブラウザー
ko: 브라우저
ru: браузер
uk: браузер
zh_hans: 浏览器
zh_hant: 瀏覽器

# createWorkspace.legend.markdown
source: markdown
ja: マークダウン
ko: 마크다운
ru: разметка
uk: розмітка

# createWorkspace.legend.terminal
source: terminal
ja: ターミナル
ko: 터미널
ru: терминал
uk: термінал
zh_hans: 终端
zh_hant: 終端機

# createWorkspace.name.hint
source: Defaults to the directory name. Override to give this workspace a custom label.
ja: ディレクトリ名がデフォルトです。このワークスペースにカスタムラベルを付ける場合は上書きしてください。
ko: 기본값은 디렉터리 이름입니다. 이 워크스페이스에 사용자 정의 레이블을 지정하려면 재정의하세요.
ru: По умолчанию — имя директории. Переопределите, чтобы задать этому рабочему пространству своё имя.
uk: За замовчуванням — назва директорії. Перевизначте, щоб дати робочому простору власну мітку.
zh_hans: 默认为目录名称。如要为该工作区指定自定义标签，请覆盖。
zh_hant: 預設為目錄名稱。如要為該工作區指定自訂標籤，請覆寫。

# createWorkspace.recents.caption
source: or select from your recent directories:
ja: または最近のディレクトリから選択:
ko: 또는 최근 디렉터리에서 선택:
ru: или выберите из недавних директорий:
uk: або виберіть з нещодавніх директорій:
zh_hans: 或从最近的目录中选择：
zh_hant: 或從最近的目錄中選擇：

# createWorkspace.recents.empty.hint
source: Pick a directory above, browse to one, or drag a folder here.
ja: 上でディレクトリを選択するか、参照するか、フォルダをここにドラッグしてください。
ko: 위에서 디렉터리를 선택하거나, 찾아보거나, 폴더를 여기로 드래그하세요.
ru: Выберите директорию выше, найдите её через обзор или перетащите папку сюда.
uk: Виберіть директорію вище, перегляньте файлову систему або перетягніть папку сюди.
zh_hans: 在上方选择目录，浏览查找，或将文件夹拖到此处。
zh_hant: 在上方選擇目錄，瀏覽查找，或將資料夾拖到此處。

# createWorkspace.recents.empty.title
source: No recent directories yet
ja: 最近のディレクトリはまだありません
ko: 아직 최근 디렉터리가 없습니다
ru: Недавних директорий пока нет
uk: Поки що немає нещодавніх директорій
zh_hans: 暂无最近的目录
zh_hant: 暫無最近的目錄

# createWorkspace.recents.hint.click
source: Click or
ja: クリックまたは
ko: 클릭 또는
ru: Щелчок или
uk: Клацніть або
zh_hans: 点击或
zh_hant: 點擊或

# createWorkspace.recents.hint.openHint
source: or double-click opens with your last layout
ja: またはダブルクリックで前回のレイアウトで開きます
ko: 또는 더블 클릭으로 마지막 레이아웃으로 열기
ru: или двойной клик откроет с прошлым макетом
uk: або подвійний клік відкриває з останнім розкладом
zh_hans: 或双击使用上次的布局打开
zh_hant: 或雙擊使用上次的版面開啟

# createWorkspace.recents.hint.toSelect
source: to select
ja: で選択
ko: 선택
ru: для выбора
uk: щоб вибрати
zh_hans: 选择
zh_hant: 選擇

# createWorkspace.recents.justNow
source: just now
ja: たった今
ko: 방금
ru: только что
uk: щойно
zh_hans: 刚刚
zh_hant: 剛剛

# createWorkspace.recents.openedMany
source: opened %d times
ja: %d 回開いた
ko: %d번 열림
ru: открыто %d раз
uk: відкрито %d разів
zh_hans: 已打开 %d 次
zh_hant: 已開啟 %d 次

# createWorkspace.recents.openedOnce
source: opened 1 time
ja: 1 回開いた
ko: 1번 열림
ru: открыто 1 раз
uk: відкрито 1 раз
zh_hans: 已打开 1 次
zh_hant: 已開啟 1 次

# createWorkspace.recents.pin
source: Pin to top
ja: トップに固定
ko: 맨 위에 고정
ru: Закрепить наверху
uk: Закріпити вгорі
zh_hans: 置顶
zh_hant: 置頂

# createWorkspace.recents.sort.opened
source: Most opened
ja: 開いた回数順
ko: 가장 많이 연 순
ru: По частоте
uk: Найчастіше відкривані
zh_hans: 打开次数最多
zh_hant: 開啟次數最多

# createWorkspace.recents.sort.recent
source: Most recent
ja: 最新順
ko: 최근순
ru: По новизне
uk: Найновіші
zh_hans: 最近的
zh_hant: 最近的

# createWorkspace.recents.unpin
source: Unpin
ja: 固定解除
ko: 고정 해제
ru: Открепить
uk: Відкріпити
zh_hans: 取消置顶
zh_hant: 取消置頂

# createWorkspace.starter.quad.description
source: Four terminal panes in a 2 × 2 grid. Agent in the top-left.
ja: ターミナル 4 つを 2 × 2 グリッドで。左上にエージェント。
ko: 터미널 4개를 2 × 2 격자로. 왼쪽 상단에 에이전트.
ru: Четыре терминальные панели в сетке 2 × 2. Агент в левом верхнем углу.
uk: Чотири термінальні панелі в сітці 2 × 2. Агент у верхньому лівому куті.
zh_hans: 四个终端窗格，2 × 2 网格。代理在左上角。
zh_hant: 四個終端機窗格，2 × 2 格線。代理在左上角。

# createWorkspace.starter.single.description
source: One terminal pane filling the workspace.
ja: ワークスペース全体を埋めるターミナルペイン 1 つ。
ko: 워크스페이스를 채우는 터미널 패널 하나.
ru: Одна терминальная панель, заполняющая рабочее пространство.
uk: Одна термінальна панель, що заповнює робочий простір.
zh_hans: 一个填满工作区的终端窗格。
zh_hant: 一個填滿工作區的終端機窗格。

# createWorkspace.starter.single.label
source: Single
ja: シングル
ko: 단일
ru: Один
uk: Один
zh_hans: 单一
zh_hant: 單一
